Repository: pypi-data/pypi-mirror-366
Catalog: packages/pdfposter/pdfposter-0.9.1.tar.gz/pdfposter-0.9.1/pdfposter/locale/*/LC_MESSAGES/pdfposter.po
Languages: fr

source: Rotating %s specs to portrait format
fr: Rotation de %s specs au format portrait

source: input dimensions: %.2f %.2f (trimbox of input page)
fr: dimensions de l'entrée : %.2f %.2f (trimbox de la page d'entrée)

source: output dimensions: %.2f %.2f (poster size)
fr: dimensions de la sortie : %.2f %.2f (taille de l'affiche)

source: Rotating poster specs since input page is landscape
fr: Rotation des spécifications de l'affiche puisque la page d'entrée est en mode paysage

source: rotated output dimensions: %.2f %.2f (poster size)
fr: dimensions de sortie tournées : %.2f %.2f (taille de l'affiche)

source: Calculated page scaling factor: %f
fr: Facteur d'échelle de page calculé : %f

source: output dimensions: %.2f %.2f (calculated)
fr: dimensions de sortie : %.2f %.2f (calculé)

source: Pages w/o rotation %s x %s
fr: Pages sans rotation %s x %s

source: Pages w/ rotation %s x %s
fr: Pages avec rotation %s x %s

source: Decided for rotation: %s
fr: Décidé pour la rotation : %s

source: yes
fr: oui

source: no
fr: non

source: Creating page with offset: %.2f %.2f
fr: Création d'une page avec décalage : %.2f %.2f

source: File is encrypted
fr: Le fichier est chiffré

source: Can't decrypt PDF. Wrong Password?
fr: Impossible de déchiffrer le PDF. Mauvais mot de passe ?

source: Mediasize : %(units_x)sx%(units_y)s %(unit)s
fr: Taille moyenne : %(units_x)sx%(units_y)s %(unit)s

source: %(width).2f %(height).2f dots
fr: %(width).2f %(height).2f points

source: Scaling by: %f
fr: Mise à l'échelle par : %f

source: Postersize: %(units_x)sx%(units_y)s %(unit)s
fr: Taille de l'affiche :%(units_x)sx%(units_y)s %(unit)s

source: ---- processing page %i -----
fr: ---- traitement de la page %i -----

source: I don't understand your box specification %r
fr: Je ne comprends pas la spécification de votre boîte %r

source: Offset not allowed in box definition
fr: Le décalage n'est pas autorisé dans la définition de la boîte

source: I don't understand your papersize name %r.
fr: Je ne comprends pas votre nom de taille de papier %r.

source: Your papersize name %r is not unique, give more chars.
fr: Votre nom de format de papier %r n'est pas unique, donnez plus de caractères.

source: A `BOX` to be passed to `--media-size` and `--poster-size` is a specification of horizontal and vertical size. The syntax is as follows (with multiplier being specified optionally): *box* = [ *multiplier* ] *unit* *multiplier* = *number* "x" *number* *unit* = *medianame* or *distancename* Please see `--help-media-names` for a list of media and distance names supported. Medias are typically not quadratic but rectangular, which means width and height differ. Thus using medianames is a bit tricky: :10x20cm: obvious: 10 cm x 20 cm (portrait) :20x10cm: same as 10x20cm, since all boxes are rotated to portrait format Now when using media names it gets tricky: :1x1a4: same as 210x297mm (21 cm x 29.7 cm, portrait) :1x2a4: same as 21x594mm (21 cm x 59.4 cm, portrait) This are two a4 pages put together at the *small* side: One portrait page wide and two portrait pages high. :2x1a4: same as 420x297mm (landscape), which is rotated to portrait and is the same as 297x420mm (29.7 cm x 42 cm) This are two a4 pages put together at the *long* side: Two portrait pages wide and one portrait page high.
fr: Une `BOX` à passer à `--media-size` et `--poster-size` est une spécification de la taille horizontale et verticale. La syntaxe est la suivante (le multiplicateur étant spécifié de manière optionnelle) : *boîte* = [ *multiplicateur* ] *unité* *multiplicateur* = *nombre* "x" *nombre* *unité* = *nom médian* ou *nom de distance* Veuillez consulter `--help-media-names` pour une liste des noms de média et de distance supportés. Les médias ne sont généralement pas quadratiques mais rectangulaires, ce qui signifie que la largeur et la hauteur diffèrent. et la hauteur diffèrent. L'utilisation des noms médians est donc un peu délicate : :10x20cm : évident : 10 cm x 20 cm (portrait) :20x10cm : même chose que 10x20 cm, puisque toutes les boîtes sont tournées au format portrait format L'utilisation des noms de médias devient un peu plus délicate : :1x1a4 : identique à 210x297 mm (21 cm x 29,7 cm, portrait) :1x2a4 : comme 21x594 mm (21 cm x 59.4 cm, portrait) Il s'agit de deux pages A4 assemblées du côté *petit* : Une page portrait en largeur et deux pages portrait en hauteur. :2x1a4 : identique à 420x297 mm (paysage), qui est tourné en portrait et correspond à 297x420 mm (paysage). portrait et équivaut à 297x420 mm (29,7 cm x 42 cm). Il s'agit de deux pages A4 assemblées sur le côté *long* : Deux pages de format portrait en largeur et une page de format portrait en hauteur.

source: Available media and distance names:
fr: Noms des supports et des distances disponibles :

source: List available media and distance names
fr: Liste des supports disponibles et des noms de distance

source: Show help about specifying BOX for `--media-size` and `--poster-size` and exit
fr: Afficher l'aide sur la spécification de BOX pour `--media-size` et `--poster-size` et quitter

source: show program's version number and exit
fr: affiche la version du programme avant de quitter

source: Be verbose. Tell about scaling, rotation and number of pages. Can be used more than once to increase the verbosity
fr: Soyez prolixe. Indique la mise à l'échelle, la rotation et le nombre de pages. Peut être utilisé plusieurs fois pour augmenter la verbosité

source: Show what would have been done, but do not generate files
fr: Affiche ce qui aurait été fait, sans créer de fichiers

source: Define Input
fr: Préciser l'entrée

source: INTEGER
fr: ENTIER

source: First page to convert (default: first page)
fr: Première page à convertir (par défaut : première page)

source: Last page to convert (default: last page)
fr: Dernière page à convertir (par défaut : dernière page)

source: Use the content area defined by the ArtBox (default: use the area defined by the TrimBox)
fr: Utiliser la zone de contenu définie par l'ArtBox (par défaut : utiliser la zone définie par la TrimBox)

source: Define Output
fr: Préciser la requête

source: Specify the page size of the output media (default: %s)
fr: Spécifie la taille de page du support de sortie (par défaut : %s)

source: Specify the poster size (defaults to media size)
fr: Spécifier la taille de l'affiche (par défaut la taille du support)

source: SCALE
fr: ÉCHELLE

source: Specify a linear scaling factor to produce the poster. The scaling factor is applied to the width and height of the input image size. Thus, a scaling factor of 2 results in a poster 4 times the area compared to the original
fr: Spécifiez un facteur d'échelle linéaire pour produire l'affiche. Le facteur d'échelle est appliqué à la largeur et à la hauteur de l'image d'entrée. Ainsi, un facteur d'échelle de 2 permet d'obtenir une affiche d'une surface quatre fois supérieure à celle de l'image originale

source: InputFile
fr: Fichier d’entrée

source: OutputFile
fr: Fichier de sortie

source: Only one of -p/--poster-size and -s/--scale may be given at a time.
fr: Une seule des options -p/--poster-size et -s/--scale peut être donnée à la fois.

source: Scale value is much to small: %s
fr: La valeur de l'échelle est beaucoup trop faible : %s

source: Scale value is much to big: %s
fr: La valeur de l'échelle est beaucoup trop grande : %s

source: The input-file is either corrupt or no PDF at all: %s
fr: Le fichier d'entrée est soit corrompu, soit ne contient aucun PDF : %s

source: usage:
fr: utilisation :

source: .__call__() not defined
fr: .__call__() non défini

source: unknown parser %(parser_name)r (choices: %(choices)s)
fr: analyseur inconnu %(parser_name)r (disponibles : %(choices)s)

source: argument "-" with mode %r
fr: argument « - » en mode %r

source: can't open '%(filename)s': %(error)s
fr: impossible d’ouvrir '%(filename)s' : %(error)s

source: cannot merge actions - two groups are named %r
fr: impossible de fusionner les actions – deux groupes ont le nom %r

source: 'required' is an invalid argument for positionals
fr: 'required' est un argument invalide pour les positions

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
fr: groupe d’options invalide %(option)r : doit commencer avec un caractère %(prefix_chars)r

source: dest= is required for options like %r
fr: dest= est requis pour les options telles que %r

source: invalid conflict_resolution value: %r
fr: valeur invalide pour conflict_resolution : %r

source: conflicting option string: %s
fr: chaîne d'options contradictoires : %s

source: mutually exclusive arguments must be optional
fr: les arguments mutuellement exclusifs doivent être facultatifs

source: positional arguments
fr: arguments de position

source: show this help message and exit
fr: afficher ce message d’aide et quitter

source: cannot have multiple subparser arguments
fr: impossible d’avoir plusieurs arguments sous-analyseurs

source: unrecognized arguments: %s
fr: arguments non reconnus : %s

source: not allowed with argument %s
fr: non autorisé avec l’argument %s

source: ignored explicit argument %r
fr: argument explicite %r ignoré

source: the following arguments are required: %s
fr: les arguments suivant sont nécessaires : %s

source: one of the arguments %s is required
fr: un des arguments %s est requis

source: expected one argument
fr: un argument attendu

source: expected at most one argument
fr: au maximum un argument attendu

source: expected at least one argument
fr: au moins un argument attendu

source: expected %s argument
fr: %s argument attendu

source: ambiguous option: %(option)s could match %(matches)s
fr: option ambigüe : %(option)s ne correspond pas à %(matches)s

source: unexpected option string: %s
fr: option inattendue : %s

source: %r is not callable
fr: %r n’est pas atteignable

source: invalid %(type)s value: %(value)r
fr: valeur %(type)s non valide : %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
fr: choix non valide : %(value)r (choisir dans %(choices)s)

source: %(prog)s: error: %(message)s
fr: %(prog)s : erreur : %(message)s
