Repository: pypi-data/pypi-mirror-366
Catalog: packages/pdfposter/pdfposter-0.9.1-py3-none-any.whl/pdfposter/locale/*/LC_MESSAGES/pdfposter.po
Languages: de, sv

source: Rotating %s specs to portrait format
de: Rotiere %s Spezifikation auf Hochformat
sv: Roterar %s specifikationer till stående format

source: input dimensions: %.2f %.2f (trimbox of input page)
de: Eingabedimensionen: %.2f %.2f (Trimbox der Eingabeseite)
sv: inmatningsmått: %.2f %.2f (trimbox på inmatningssidan)

source: output dimensions: %.2f %.2f (poster size)
de: Ausgabedimensionen: %.2f %.2f (Postergröße)
sv: utmatningsmått: %.2f %.2f (affischstorlek)

source: Rotating poster specs since input page is landscape
de: Drehe die Poster-Spezifikation, da die Input-Seite Querformat ist
sv: Roterande affischspecifikationer eftersom inmatningssidan är liggande

source: rotated output dimensions: %.2f %.2f (poster size)
de: Gedrehte Ausgabedimensionen: %.2f %.2f (Postergröße)
sv: roterade utdatamått: %.2f %.2f (affischstorlek)

source: Calculated page scaling factor: %f
de: Berechneter Vergrößerungsfaktor: %f
sv: Beräknad sidskalningsfaktor: %f

source: output dimensions: %.2f %.2f (calculated)
de: Ausgabedimensionen: %.2f %.2f (berechnet)
sv: utmatningsmått: %.2f %.2f (beräknad)

source: Pages w/o rotation %s x %s
de: Seiten ohne Drehen %s x %s
sv: Sidor utan rotation %s x %s

source: Pages w/ rotation %s x %s
de: Seiten mit Drehen %s x %s
sv: Sidor med rotation %s x %s

source: Decided for rotation: %s
de: Entschieden zu drehen: %s
sv: Beslutad för rotation: %s

source: yes
de: ja
sv: Ja

source: no
de: nein
sv: nej

source: Creating page with offset: %.2f %.2f
de: Erzeuge Seite mit Offset: %.2f %.2f
sv: Skapar sida med offset: %.2f %.2f

source: File is encrypted
de: Datei ist verschlüsselt
sv: Filen är krypterad

source: Can't decrypt PDF. Wrong Password?
de: Kann das PDF nicht entschlüsseln. Vielleicht das falsche Passwort?
sv: Kan inte dekryptera PDF:en. Fel lösenord?

source: Mediasize : %(units_x)sx%(units_y)s %(unit)s
de: Mediengröße: %(units_x)sx%(units_y)s %(unit)s
sv: Mediastorlek: %(units_x)sx%(units_y)s %(unit)s

source: %(width).2f %(height).2f dots
de: %(width).2f %(height).2f Rasterpunkte
sv: %(width).2f %(height).2f punkter

source: Scaling by: %f
de: Vergrößere um: %f
sv: Skalning med: %f

source: Postersize: %(units_x)sx%(units_y)s %(unit)s
de: Postergröße: %(units_x)sx%(units_y)s %(unit)s
sv: Postersstorlek: %(units_x)sx%(units_y)s %(unit)s

source: ---- processing page %i -----
de: ---- verarbeite Seite %i -----
sv: ---- bearbetar sida %i -----

source: I don't understand your box specification %r
de: Ich verstehe die Box-Spezifikation %r nicht
sv: Jag förstår inte din boxspecifikation %r

source: Offset not allowed in box definition
de: Versatz ist in der Box-Spezifikation nicht zulässig
sv: Offset inte tillåtet i boxdefinitionen

source: I don't understand your papersize name %r.
de: Verstehe den angegebenen Papierformatnamen %r nicht.
sv: Jag förstår inte ditt pappersstorleksnamn %r.

source: Your papersize name %r is not unique, give more chars.
de: Der Papierformatnamen %r ist nicht eindeutig, bitte gib mehr Buchstaben an.
sv: Ditt pappersstorleksnamn %r är inte unikt, ge fler tecken.

source: A `BOX` to be passed to `--media-size` and `--poster-size` is a specification of horizontal and vertical size. The syntax is as follows (with multiplier being specified optionally): *box* = [ *multiplier* ] *unit* *multiplier* = *number* "x" *number* *unit* = *medianame* or *distancename* Please see `--help-media-names` for a list of media and distance names supported. Medias are typically not quadratic but rectangular, which means width and height differ. Thus using medianames is a bit tricky: :10x20cm: obvious: 10 cm x 20 cm (portrait) :20x10cm: same as 10x20cm, since all boxes are rotated to portrait format Now when using media names it gets tricky: :1x1a4: same as 210x297mm (21 cm x 29.7 cm, portrait) :1x2a4: same as 21x594mm (21 cm x 59.4 cm, portrait) This are two a4 pages put together at the *small* side: One portrait page wide and two portrait pages high. :2x1a4: same as 420x297mm (landscape), which is rotated to portrait and is the same as 297x420mm (29.7 cm x 42 cm) This are two a4 pages put together at the *long* side: Two portrait pages wide and one portrait page high.
de: Eine `BOX`, die an `--media-size` und `--poster-size` übergeben wird, ist eine Angabe der horizontalen und vertikalen Größe. Die Syntax lautet wie folgt (wobei der Multiplikator optional ist): *Box* = [ *Multiplikator* ] *Einheit* *Multiplikator* = *Zahl* "x" *Zahl* *Einheit* = *Medianame* oder *Längename* Eine Liste der unterstützten Medien- und Längennamen finden Sie unter `--help-media-names`.. Medien sind normalerweise nicht quadratisch, sondern rechteckig, was bedeutet, dass Breite und Höhe unterschiedlich sind. Daher ist die Verwendung von Mediannamen etwas trickreich: :10x20cm: offensichtlich: 10 cm x 20 cm (Hochformat) :20x10cm: wie 10x20cm, da alle Boxen ins Hochformat gedreht werden Bei der Verwendung von Mediennamen wird es nun knifflig: :1x1a4: entspricht 210x297mm (21 cm x 29,7 cm, Hochformat) :1x2a4: entspricht 210x594mm (21 cm x 59,4 cm, Hochformat) Das sind zwei a4-Seiten, die an der *schmalen* Seite zusammengefügt werden: Eine Hochformat-Seite breit und zwei Hochformat-Seiten hoch. :2x1a4: entspricht 420x297mm (Querformat), was ins Hochformat gedreht wird und damit 297x420mm (29,7 cm x 42 cm) Hochformat ergeben Dies sind zwei A4-Seiten, die an der *langen* Seite zusammengefügt werden: Zwei Hochformat-Seiten breit und eine Hochformat-Seite hoch.
sv: En "BOX" som ska skickas till "--media-size" och "--poster-size" är en specifikation av horisontell och vertikal storlek. Syntaxen är som följer (med multiplikator specificeras valfritt): *box* = [ *multiplikator* ] *enhet* *multiplikator* = *nummer* "x" *nummer* *enhet* = *medianamn* eller *avståndsnamn* Se `--help-media-names` för en lista över media och distansnamn stöds. Media är vanligtvis inte kvadratiska utan rektangulära, vilket betyder bredd och höjden skiljer sig åt. Att använda medianamn är därför lite knepigt: :10x20cm: självklart: 10 cm x 20 cm (porträtt) :20x10cm: samma som 10x20cm, eftersom alla lådor roteras till porträtt format Nu när du använder medienamn blir det knepigt: :1x1a4: samma som 210x297 mm (21 cm x 29,7 cm, stående) :1x2a4: samma som 21x594 mm (21 cm x 59,4 cm, stående) Detta är två A4-sidor sammansatta på den *lilla* sidan: stående sida bred och två stående sidor hög. :2x1a4: samma som 420x297mm (liggande), som roteras till stående och är samma som 297x420 mm (29,7 cm x 42 cm) Detta är två A4-sidor sammansatta på *långsidan: Två porträttsidor breda och en porträttsida hög.

source: Available media and distance names:
de: Verfügbare Papier- und Längennamen:
sv: Tillgängliga media- och distansnamn:

source: List available media and distance names
de: Zeige die verfügbaren Papier- und Längennamen
sv: Lista tillgängliga media och avståndsnamn

source: Show help about specifying BOX for `--media-size` and `--poster-size` and exit
de: Hilfe zum Spezifizieren von BOX für `--media-size` und `--poster-size`zeigen und beenden
sv: Visa hjälp om att ange BOX för `--media-size` och `--poster-size` och avsluta

source: show program's version number and exit
de: zeige die Versionsnummer des Programms und beende
sv: visa programmets versionsnummer och avsluta

source: Be verbose. Tell about scaling, rotation and number of pages. Can be used more than once to increase the verbosity
de: Ausführlich sein. Informiert über Skalierung, Drehung und Anzahl der Seiten. Kann mehrals einmal verwendet werden, um die Ausführlichkeit zu erhöhen
sv: Var talrik. Berätta om skalning, rotation och antal sidor. Kan användas mer än en gång för att öka detaljrikedomen

source: Show what would have been done, but do not generate files
de: Zeige, was getan würde, aber erzeuge keine Dateien
sv: Visa vad som skulle ha skett, men skapa inga filer

source: Define Input
de: Eingangsdaten präzisieren
sv: Precisera inmatningen

source: INTEGER
de: ZAHL
sv: HELTAL

source: First page to convert (default: first page)
de: Erste zu konvertierende Seite (Standard: erste Seite)
sv: Första sidan att konvertera (standard: första sidan)

source: Last page to convert (default: last page)
de: Letzte zu konvertierende Seite (Standard: letzte Seite)
sv: Sista sidan att konvertera (standard: sista sidan)

source: Use the content area defined by the ArtBox (default: use the area defined by the TrimBox)
de: Den durch die ArtBox definierten Inhaltsbereich verwenden (Standard: den durch die TrimBox definierten Bereich verwenden)
sv: Använd innehållsområdet som definieras av ArtBox (standard: använd området som definieras av TrimBox)

source: Define Output
de: Ausgabe präzisieren
sv: Precisera Utmatnings

source: BOX
sv: LÅDA

source: Specify the page size of the output media (default: %s)
de: Größe eines Blattes des Ausgabemediums (Standard: %s)
sv: Ange sidstorleken för utmatningsmediet (standard: %s)

source: Specify the poster size (defaults to media size)
de: Größe des zu erstellenden Posters (Standard: Papiergröße)
sv: Ange affischstorlek (standard till mediastorlek)

source: SCALE
de: FAKTOR
sv: SKALA

source: Specify a linear scaling factor to produce the poster. The scaling factor is applied to the width and height of the input image size. Thus, a scaling factor of 2 results in a poster 4 times the area compared to the original
de: Geben Sie einen linearen Skalierungsfaktor für die Erstellung des Posters an. Der Skalierungsfaktor wird auf die Breite und Höhe des Eingabebildes angewendet. Ein Skalierungsfaktor von 2 führt also zu einem Poster mit der 4-fachen Fläche im Vergleich zum Original<
sv: Ange en linjär skalningsfaktor för att producera affischen. Skalningsfaktorn tillämpas på bredden och höjden på den inmatade bildstorleken. En skalningsfaktor på 2 resulterar alltså i en affisch som är 4 gånger så stor yta jämfört med originalet

source: InputFile
de: Eingabedatei
sv: InmatningsFil

source: OutputFile
de: Ausgabedatei
sv: UtmatningsFil

source: Only one of -p/--poster-size and -s/--scale may be given at a time.
de: Es darf jeweils nur eine der beiden Angaben -p/--poster-size und -s/--scale angegeben werden.
sv: Endast en av -p/--affischstorlek och -s/--skala får ges åt gången.

source: Scale value is much to small: %s
de: Vergrößerungsfaktor ist viel zu klein: %s
sv: Skalvärdet är mycket för litet: %s

source: Scale value is much to big: %s
de: Vergrößerungsfaktor ist viel zu groß: %s
sv: Skalvärdet är mycket för stort: %s

source: The input-file is either corrupt or no PDF at all: %s
de: Die Eingabedatei ist entweder beschädigt oder überhaupt kein PDF: %s
sv: Inmatningsfilen är antingen korrupt eller ingen PDF alls: %s

source: usage:
de: Aufruf:
sv: användning:

source: .__call__() not defined
de: .__call__() ist nicht definiert
sv: .__call__() är inte definierad

source: unknown parser %(parser_name)r (choices: %(choices)s)
de: unbekannter Parser %(parser_name)r (Auswahl: %(choices)s)
sv: okänd parser %(parser_name)r (valmöjligheter: %(choices)s)

source: argument "-" with mode %r
de: Argument "-" mit Modus %r
sv: argument "-" med läge %r

source: can't open '%(filename)s': %(error)s
de: kann Datei '%(filename)s' nicht öffnen: %(error)s
sv: kan inte öppna '%(filename)s': %(error)s

source: cannot merge actions - two groups are named %r
de: Aktionen können nicht zusammengeführt werden - zwei Gruppen mit Namen %r
sv: kan inte sammanfoga ageranden(actions) - två grupper kallas %r

source: 'required' is an invalid argument for positionals
de: 'required' ist nicht erlaubt für positionale Argumente
sv: 'required' är en otillåten parameter för ordningsföljdsberoende parametrar

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
de: ungültiger Optionsstring %(option)r: muss mit einem Zeichen %(prefix_chars)r beginnen
sv: felaktig parametersträng %(option)r: måste börja med ett av tecknen %(prefix_chars)r

source: dest= is required for options like %r
de: dest= ist erforderlich für Optionen wie %r
sv: dest= krävs för parametrar som %r

source: invalid conflict_resolution value: %r
de: ungültiger Konfliktlösungswert: %r
sv: felaktigt värde för conflict_resolution: %r

source: conflicting option string: %s
de: widersprüchliche Optionszeichenfolge: %s
sv: sträng för parameternamn står i konflikt: %s

source: mutually exclusive arguments must be optional
de: sich gegenseitig ausschließende Argumente müssen optional sein
sv: parametrar som inte tillåts tillsammans måste vara frivilliga

source: positional arguments
de: positionale Argumente
sv: ordningsföljdsberoende parametrar

source: options
de: Optionen
sv: Alternativ

source: show this help message and exit
de: diese Hilfemeldung anzeigen und beenden
sv: visa denna hjälp och avsluta

source: cannot have multiple subparser arguments
de: kann nicht mehrere Subparser-Argumente haben
sv: kan inte ha flera subparser-parametrar

source: unrecognized arguments: %s
de: nicht erkannte Argumente: %s
sv: ej igenkända parametrar: %s

source: not allowed with argument %s
de: nicht erlaubt mit Argument %s
sv: tillåts ej med parametern/parametrarna %s

source: ignored explicit argument %r
de: ignoriertes explizites Argument %r
sv: ignorerade uttryckligt givet parametervärde %r

source: the following arguments are required: %s
de: die folgenden Argumente sind erforderlich: %s
sv: följande parametrar är obligatoriska: %s

source: one of the arguments %s is required
de: eines der Argumente %s ist erforderlich
sv: en av parametrarna %s krävs

source: expected one argument
de: ein Argument erwartet
sv: förväntade sig ett parametervärde

source: expected at most one argument
de: höchstens ein Argument erwartet
sv: som mest ett parametervärde förväntades

source: expected at least one argument
de: mindestens ein Argument erwartet
sv: minst ett parametervärde förväntades

source: expected %s argument
de: %s Argument erwartet
sv: förväntade sig %s parametervärde

source: ambiguous option: %(option)s could match %(matches)s
de: mehrdeutige Option: %(option)s könnte %(matches)s entsprechen
sv: tvetydigt parameternamn: %(option)s skulle kunna matcha %(matches)s

source: unexpected option string: %s
de: unerwartete Optionszeichenfolge: %s
sv: oväntad parameternamnssträng: %s

source: %r is not callable
de: %r ist nicht aufrufbar
sv: %r är inte anropsbar

source: invalid %(type)s value: %(value)r
de: ungültiger Wert für %(type)s: %(value)r
sv: felaktigt %(type)s-värde: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
de: ungültige Auswahl: %(value)r (wählen Sie aus %(choices)s)
sv: felaktigt val: %(value)r (välj från %(choices)s)

source: %(prog)s: error: %(message)s
de: %(prog)s: Fehler: %(message)s
sv: %(prog)s: fel: %(message)s
