
eng_0_to_9 = {
    "0": "zero",
    "1": "one",
    "2": "two",
    "3": "three",
    "4": "four",
    "5": "five",
    "6": "six",
    "7": "seven",
    "8": "eight",
    "9": "nine",

}
eng_10_to_19={
    "10": "ten",
    "11": "eleven",
    "12": "twelve",
    "13": "thirteen",
    "14": "fourteen",
    "15": "fifteen",
    "16": "sixteen",
    "17": "seventeen",
    "18": "eighteen",
    "19": "nineteen"
}
eng_10_to_90 = {
    "10": "ten",
    "20": "twenty",
    "30": "thirty",
    "40": "forty",
    "50": "fifty",
    "60": "sixty",
    "70": "seventy",
    "80": "eighty",
    "90": "ninety"
}

eng_100_to_900 = {
    "100": "one hundred",
    "200": "two hundred",
    "300": "three hundred",
    "400": "four hundred",
    "500": "five hundred",
    "600": "six hundred",
    "700": "seven hundred",
    "800": "eight hundred",
    "900": "nine hundred"
}

indian_eng_above_thousand = [
    "",
    "thousand",
    "lakh",
    "crore",
    "arab",
    "kharab",
    "neel",
    "padma",
]
standard_international_eng_above_thousand = [
    "",
    "thousand",
    "million",
    "billion",
    "trillion",
    "quadrillion"
]

tam_0_to_9 = {
    "0": "பூஜ்யம்",     # Pūjyam
    "1": "ஒன்று",      # Ondru
    "2": "இரண்டு",     # Iraṇṭu
    "3": "மூன்று",     # Mūnru
    "4": "நான்கு",     # Nāṉku
    "5": "ஐந்து",      # Aindhu
    "6": "ஆறு",        # Āṟu
    "7": "ஏழு",        # Eḻu
    "8": "எட்டு",      # Eṭṭu
    "9": "ஒன்பது"      # Oṉpathu
}
tam_10_to_19 = {
    "10": "பத்து",         # Paththu
    "11": "பதினொன்று",    # Pathinonru
    "12": "பன்னிரண்டு",    # Panniraṇḍu
    "13": "பதின்மூன்று",  # Pathinmūnru
    "14": "பதினான்கு",    # Pathināṉku
    "15": "பதினைந்து",    # Pathinaindhu
    "16": "பதினாறு",      # Pathināṟu
    "17": "பதினேழு",      # Pathinēḻu
    "18": "பதினெட்டு",    # Pathineṭṭu
    "19": "பத்தொன்பது"    # Paththoṉpathu
}
tam_10_to_90 = {
    "10": ("பத்து", "பத்து"),
    "20": ("இருபது", "இருபத்து"),
    "30": ("முப்பது", "முப்பத்து"),
    "40": ("நாற்பது", "நாற்பத்து"),
    "50": ("ஐம்பது", "ஐம்பத்து"),
    "60": ("அறுபது", "அறுபத்து"),
    "70": ("எழுபது", "எழுபத்து"),
    "80": ("எண்பது", "எண்பத்து"),
    "90": ("தொண்ணூறு", "தொண்ணூற்று")
}

tam_100_to_900 = {
    "100": ("நூறு", "நூற்று"),
    "200": ("இருநூறு", "இருநூற்று"),
    "300": ("முன்நூறு", "முன்நூற்று"),
    "400": ("நானூறு", "நானூற்று"),
    "500": ("ஐநூறு", "ஐநூற்று"),
    "600": ("அறுநூறு", "அறுநூற்று"),
    "700": ("எழுநூறு", "எழுநூற்று"),
    "800": ("எண்ணூறு", "எண்ணூற்று"),
    "900": ("தொள்ளாயிரம்", "தொள்ளாயிரத்து")
}


tamil_named_numbers = {
    "0":("",""),
    "1000": ("ஆயிரம்", "ஆயிரத்து"),
    "100000": ("இலட்சம்", "இலட்சத்து"),
    "10000000": ("கோடி", "கோடியே"),
    "1000000000": ("அரபு", "அரபீயே"),
    "100000000000": ("கறோபதி", "கறோபதியே"),
    "10000000000000": ("நீல்", "நீலின்"),
    "1000000000000000": ("பதுமம்", "பதுமத்தி"),
    "100000000000000000": ("சங்கம்", "சங்கத்தி")
}

tamil_name_formation=[
("",""),
("ஆயிரம்", "ஆயிரத்து"),
("இலட்சம்", "இலட்சத்து"),
("கோடி", "கோடியே"),
("அரபு", "அரபீயே"),
("கறோபதி", "கறோபதியே"),
("நீல்", "நீலின்"),
("பதுமம்", "பதுமத்தி"),
("சங்கம்", "சங்கத்தி")
]
